Downloads/ADSI-SistemaSolar-Airbnb-master/app/views/properties/show.html.erb

</div>
<% @property.services.each do |service|%>
---
SELECT "services".* FROM "services" INNER JOIN "has_services" ON "services"."id" = "has_services"."service_id" WHERE "has_services"."property_id" = ?  [["property_id", 1]]