Downloads/ADSI-SistemaSolar-Airbnb-master/app/controllers/searches_controller.rb

	def new
		@search = Search.new
		@categories = Property.uniq.pluck(:tipo)
---
SELECT DISTINCT "properties"."tipo" FROM "properties"

	def create

		@search = Search.create(search_params)
---
INSERT INTO "searches" ("direccion", "descripcion", "maxPrice", "servicios", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["direccion", "gu"], ["descripcion", "gu"], ["maxPrice", #<BigDecimal:b30de004,'0.5E3',9(18)>], ["servicios", ""], ["created_at", 2017-05-18 23:35:34 UTC], ["updated_at", 2017-05-18 23:35:34 UTC]]