Downloads/ADSI-SistemaSolar-Airbnb-master-2/Airbnb-ITAM/app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE (descripcion LIKE '%%')
---
	 def index
  	@properties = Property.search(params[:search])

INSERT INTO "has_services" ("property_id", "service_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["property_id", 9], ["service_id", 1], ["created_at", 2017-05-18 20:49:53 UTC], ["updated_at", 2017-05-18 20:49:53 UTC]]
INSERT INTO "properties" ("tipo", "direccion", "precio", "descripcion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tipo", "departamento"], ["direccion", "a"], ["precio", 25000.0], ["descripcion", "a"], ["created_at", 2017-05-02 18:09:52 UTC], ["updated_at", 2017-05-02 18:09:52 UTC]]
---
  def create
  	@property =Property.new (property_params)
    @property.services = params[:services]
  	@property.save